package com.javarush.task.task03.task0305;

/* 
Я так давно родился

Вывести на экран дату своего рождения в виде:
MAY 1 2012
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("APRIL 11 1972");
    }
}
