package com.javarush.task.task03.task0308;

/* 
Произведение 10 чисел

Вывести на экран произведение 10 чисел от 1 до 10.
Результат — это 1 число.

Подсказка:
будет три миллиона с хвостиком.
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println(1*2*3*4*5*6*7*8*9*10);
    }
}
